Revit 2027 API
CustomInitialColor(CustomInitialColor) Constructor
 Creates a copy of the given custom initial color
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CustomInitialColor(
	CustomInitialColor other
)
Public Sub New (
	other As CustomInitialColor
)
public:
CustomInitialColor(
	CustomInitialColor^ other
)
new :
        other : CustomInitialColor -> CustomInitialColor
Parameters
other CustomInitialColor
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CustomInitialColor Class
CustomInitialColor Overload
Autodesk.Revit.DB.Lighting Namespace